unobtrusive/app/controllers/messages_controller.rb

SELECT * FROM "messages" ORDER BY created_at DESC
---
  def index
    @messages = Message.all

INSERT INTO "messages" ("message", "updated_at", "author", "created_at") VALUES('aa', '2009-05-21 13:12:03', 'aa', '2009-05-21 13:12:03')
---
  def create
    @message = Message.create(:author => params[:author], :message => params[:message])