obtrusive/app/controllers/messages_controller.rb

SELECT * FROM "messages" ORDER BY created_at DESC
---
  def index
    @messages = Message.all

INSERT INTO "messages" ("message", "updated_at", "author", "created_at") VALUES('test', '2009-05-21 12:00:05', 'pet3r', '2009-05-21 12:00:05')
---
  def create
    @message = Message.create(:author => params[:author], :message => params[:message])