unobtrusive-prototype/app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM "messages" ORDER BY created_at DESC

  def create
    @message = Message.create!(params[:message])
---
INSERT INTO "messages" ("message", "updated_at", "author", "created_at") VALUES('Message 1', '2009-05-21 17:02:31', 'Test', '2009-05-19 17:02:31')